In [12]:
# Initial imports
import pandas as pd
import hvplot.pandas
from sqlalchemy import create_engine

In [13]:
# Define the databaser URL
db_url = "postgresql://postgres:postgres@localhost:5432/agent_db"

# Create the engine object
engine = create_engine(db_url)

# Write the SQL query
query = 'select * from agents'
# Read the SQL query into a DataFrame
agents = pd.read_sql(query, engine)
# Show the DataFrame's head
agents.head()

   agent_id first_name last_name
0         1      Diana       Lee
1         2    Anthony    Garcia
2         3      Karen   Clinton

In [14]:
query1 = 'select count agent_id, count(region_id) from agent_region_junction group by agent_id'

In [16]:
agents_byregion = pd.read_sql(query, engine)

In [17]:
agents_byregion

   agent_id first_name last_name
0         1      Diana       Lee
1         2    Anthony    Garcia
2         3      Karen   Clinton